<a href="https://colab.research.google.com/github/akipi-ro/b/blob/master/4/12.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd


df1 = pd.DataFrame({
    "A": ["A0", "A1", "A2"],
    "B": ["B0", "B1", "B2"],
    "C": ["C0", "C1", "C2"]})

df2 = pd.DataFrame({
    "A": ["A3", "A4", "A5"],
    "B": ["B3", "B4", "B5"],
    "C": ["C3", "C4", "C5"]})

df3 = pd.DataFrame({
    "A": ["A3", "A4", "A5"],
    "B": ["B3", "B4", "B5"],
    "D": ["D3", "D4", "D5"]})

In [10]:
 df1_df2 = df1.append(df2)
 df1_df2= df1_df2.reset_index(drop=True)
 df1_df2

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4
5  A5  B5  C5

In [15]:
# df1_df3 = pd.concat([df1,df3],sort=True)
df1_df3 = pd.concat([df1,df3],axis=1)#よこ
df1_df3 = df1_df3.reset_index(drop=True)
df1_df3

    A   B   C   A   B   D
0  A0  B0  C0  A3  B3  D3
1  A1  B1  C1  A4  B4  D4
2  A2  B2  C2  A5  B5  D5

In [18]:
df1_df2_df3 = pd.concat([df1, df2, df3], sort = True)
df1_df2_df3 = df1_df2_df3.reset_index(drop = True)
df1_df2_df3

    A   B    C    D
0  A0  B0   C0  NaN
1  A1  B1   C1  NaN
2  A2  B2   C2  NaN
3  A3  B3   C3  NaN
4  A4  B4   C4  NaN
5  A5  B5   C5  NaN
6  A3  B3  NaN   D3
7  A4  B4  NaN   D4
8  A5  B5  NaN   D5

In [0]:
df4 = pd.DataFrame({
    "A":  ["A0", "A1", "A2", "A3"],
    "B": ["B0", "B1", "B2", "B3"],
    "K": ["K0", "K1", "K2", "K3"]})

df5 = pd.DataFrame({
    "K": ["K0", "K1", "K3", "K4"],
    "C": ["C0", "C1", "C3", "C4"],
    "D": ["D0", "D1", "D3", "D4"]},
    index=[0, 1, 3, 4])

In [30]:
df4_df5 = pd.merge(df4,df5,on = "K", how = "outer")
df4_df5

     A    B   K    C    D
0   A0   B0  K0   C0   D0
1   A1   B1  K1   C1   D1
2   A2   B2  K2  NaN  NaN
3   A3   B3  K3   C3   D3
4  NaN  NaN  K4   C4   D4

In [35]:
df6 = pd.DataFrame({
    "A": ["A0", "A1", "A2", "A3"],
    "B": ["B0", "B1", "B2", "B3"],
    "K": ["K0", "K1", "K2", "K3"],
    "M": ["M0", "M1", "M2", "M3"]})

df7 = pd.DataFrame({
    "K": ["K0", "K1", "K3", "K4"],
    "M": ["M0", "M1", "M3", "M4"],
    "C": ["C0", "C1", "C3", "C4"],
    "D": ["D0", "D1", "D3", "D4"]},
    index=[0, 1, 3, 4])

    K   M   C   D
0  K0  M0  C0  D0
1  K1  M1  C1  D1
3  K3  M3  C3  D3
4  K4  M4  C4  D4

In [36]:
df6

    A   B   K   M
0  A0  B0  K0  M0
1  A1  B1  K1  M1
2  A2  B2  K2  M2
3  A3  B3  K3  M3

In [37]:
df6_df7 = pd.merge(df6, df7, on=["K", "M"], how="inner")
df6_df7

    A   B   K   M   C   D
0  A0  B0  K0  M0  C0  D0
1  A1  B1  K1  M1  C1  D1
2  A3  B3  K3  M3  C3  D3

In [38]:
df8 = pd.DataFrame({
    "A": ["A0", "A1", "A2"],
    'B': ["B0", "B1", "B2"]})
df9 = pd.DataFrame({
    "C": ["C0", "C2", "C3"],
    'D': ["D0", "D2", "D3"]},
    index=[0, 2, 3])

df8.join(df9,how="outer")

     A    B    C    D
0   A0   B0   C0   D0
1   A1   B1  NaN  NaN
2   A2   B2   C2   D2
3  NaN  NaN   C3   D3

In [22]:
df1= pd.read_csv("kansai.csv")
df2= pd.read_csv("kanto.csv")
df1

  prefecture  region capital_city major_station_1
0      Osaka  Kansai        Osaka           Umeda
1      Kyoto  Kansai        Kyoto           Kyoto
2       Nara  Kansai         Nara            Nara
3      Hyogo  Kansai         Kobe            Kobe

In [33]:
df2

  prefecture region capital_city major_station_1 major_station_2
0      Tokyo  Kanto        Tokyo           Tokyo        Shinjuku
1    Saitama  Kanto      Saitama           Omiya           Urawa
2   Kanagawa  Kanto     Yokohama        Yokohama        Kawasaki

In [34]:
# df1_df2 = pd.concat([df1,df2],sort = True)　こうするとアルファベット順になってしまう
df1_df2 = pd.concat([df1,df2],sort = False)
df1_df2 = df1_df2.reset_index(drop = True)
df1_df2
# pd.concat()

  prefecture  region capital_city major_station_1 major_station_2
0      Osaka  Kansai        Osaka           Umeda             NaN
1      Kyoto  Kansai        Kyoto           Kyoto             NaN
2       Nara  Kansai         Nara            Nara             NaN
3      Hyogo  Kansai         Kobe            Kobe             NaN
4      Tokyo   Kanto        Tokyo           Tokyo        Shinjuku
5    Saitama   Kanto      Saitama           Omiya           Urawa
6   Kanagawa   Kanto     Yokohama        Yokohama        Kawasaki

In [0]:
df1_df2.fillna("NaN")
df1_df2.to_csv("kanto_kansai.csv",index=False)

In [0]:
df1_df2.to_csv("kanto_kansai.csv")

In [0]:
df3= pd.read_csv("class.csv")
df4= pd.read_csv("grade.csv")

In [6]:
df3

   student_number     name  age    nationality
0               1     Jack    7        England
1               2     John   10  United States
2               3    Alice   12        England
3               4      Bob    7      Australia
4               5  Dominic    8        Germany
5               6    Akiko   11          Japan
6               7    Carly    6         Canada

In [7]:
df4

   student_number     name  math  science
0               1     Jack    32       19
1               2     John    73       63
2               3    Alice    90       85
3               5  Dominic    45       58
4               6    Akiko    87       66

In [16]:
df3_df4 = pd.merge(df3, df4, on=["student_number", "name"], how="inner")
df3_df4

   student_number     name  age    nationality  math  science
0               1     Jack    7        England    32       19
1               2     John   10  United States    73       63
2               3    Alice   12        England    90       85
3               5  Dominic    8        Germany    45       58
4               6    Akiko   11          Japan    87       66

In [0]:
df3_df4.to_csv("class_grade.csv",index=False)